In [1]:
!pip install pymysql

Requirement already satisfied: pymysql in c:\users\arjun\anaconda3\lib\site-packages (1.1.0)

In [3]:
import pymysql as py

In [6]:
conn =py.connect(user='root',
                 password='Arjun@2585',
                 host= 'localhost',
                 autocommit = True,)
print('done')

done

In [8]:
cur=conn.cursor()
print('done')

done

In [11]:
q='''use emp;'''

In [12]:
cur.execute(q)

0

In [17]:
q='''show tables'''
cur.execute(q)
result=cur.fetchall()

In [18]:
result

(('copydetails',), ('details',), ('salery_details',))

In [27]:
col=cur.description[0][0]

In [28]:
import pandas as pd

In [30]:
table = pd.DataFrame(result,columns=[col])

In [31]:
table

    Tables_in_emp
0     copydetails
1         details
2  salery_details

In [45]:
q='''select * from copydetails ;'''
cur.execute(q)
#col = cur.description
col=[i[0] for i in cur.description]

result=cur.fetchall()
#print('done')
product=pd.DataFrame(result,columns=col)
product

,Emp_id,name,Salery,designation,Department,manager_id,project_id
0,1,Arjun,S1,Software Devloper,IT,101,A1
1,2,Jatin,S2,Halper,HR,102,A2
2,3,Sumit,S3,Eng,IT,103,A3
3,4,Parteek,S4,Data Science,IT,104,A4
4,5,Manjeet,S5,Govt Emp,HR,105,A5
5,6,Deepak,S6,Vlsi,IT,106,A6
6,7,Parakshit,S7,Manager,HR,107,A7

In [56]:
def show_table(tabelname):
    
    try:
    
        q=f'''select * from {tabelname};'''
        cur.execute(q)
        col=[i[0] for i in cur.description]
        result=cur.fetchall()

        product=pd.DataFrame(result,columns=col)
        return product
    
    except:
        print('Arjun Some Error in Your code')

In [57]:

show_table('copydetails')

,Emp_id,name,Salery,designation,Department,manager_id,project_id
0,1,Arjun,S1,Software Devloper,IT,101,A1
1,2,Jatin,S2,Halper,HR,102,A2
2,3,Sumit,S3,Eng,IT,103,A3
3,4,Parteek,S4,Data Science,IT,104,A4
4,5,Manjeet,S5,Govt Emp,HR,105,A5
5,6,Deepak,S6,Vlsi,IT,106,A6
6,7,Parakshit,S7,Manager,HR,107,A7

In [61]:
def make_conn(pwd):
    conn =py.connect(user='root',
                 password=pwd,
                 host= 'localhost',
                 autocommit = True,)
    
    cur=conn.cursor()
    return cur

In [62]:
make_conn('Arjun@2585')

In [70]:
def run_Query(q):
    
    cur.execute(q)
    result=cur.fetchall()
    
    col=[i[0] for i in cur.description]
    product=pd.DataFrame(result,columns=col)
    return product

In [67]:
#run_Query('''Show Databases;''')

             Database
0               arjun
1   countrypopulation
2                 emp
3                 hms
4  information_schema
5                isro
6               mysql
7  performance_schema
8             product
9                 sys

In [71]:
run_Query('use emp;')

TypeError: 'NoneType' object is not iterable